#### Working with missing values

In [1]:
from pandas import*
import pandas as pd
from numpy import*
import numpy as np

In [3]:
data = read_csv('http://bit.ly/uforeports')
data.head(3)

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

In [5]:
data['Colors Reported'].head(3)

0    NaN
1    NaN
2    NaN
Name: Colors Reported, dtype: object

In [ ]:
#Not a number.....NaN

In [7]:
data.isnull().tail()

        City  Colors Reported  Shape Reported  State   Time
18236  False             True           False  False  False
18237  False             True           False  False  False
18238  False             True            True  False  False
18239  False            False           False  False  False
18240  False             True           False  False  False

In [8]:
data.notnull().tail()

       City  Colors Reported  Shape Reported  State  Time
18236  True            False            True   True  True
18237  True            False            True   True  True
18238  True            False           False   True  True
18239  True             True            True   True  True
18240  True            False            True   True  True

In [9]:
data.isnull().sum()

City                  25
Colors Reported    15359
Shape Reported      2644
State                  0
Time                   0
dtype: int64

In [11]:
pd.Series([True, False,True]).sum() # True as 1 and False as 0

2

In [16]:
data[data.City.isnull()].head(3)

    City Colors Reported Shape Reported State             Time
21   NaN             NaN            NaN    LA   8/15/1943 0:00
22   NaN             NaN          LIGHT    LA   8/15/1943 0:00
204  NaN             NaN           DISK    CA  7/15/1952 12:30

In [17]:
data.shape

(18241, 5)

In [18]:
data.dropna(how = 'any').shape

(2486, 5)

In [19]:
data.shape

(18241, 5)

In [20]:
data.dropna(how = "all").shape

(18241, 5)

In [21]:
data.dropna(subset=['City','Shape Reported'],how = 'any').shape

(15576, 5)

In [22]:
data.dropna(subset=['City','Shape Reported'],how = 'all').shape

(18237, 5)

In [25]:
data['Shape Reported'].value_counts()

LIGHT        2803
DISK         2122
TRIANGLE     1889
OTHER        1402
CIRCLE       1365
SPHERE       1054
FIREBALL     1039
OVAL          845
CIGAR         617
FORMATION     434
VARIOUS       333
RECTANGLE     303
CYLINDER      294
CHEVRON       248
DIAMOND       234
EGG           197
FLASH         188
TEARDROP      119
CONE           60
CROSS          36
DELTA           7
CRESCENT        2
ROUND           2
DOME            1
FLARE           1
HEXAGON         1
PYRAMID         1
Name: Shape Reported, dtype: int64

In [29]:
data['Shape Reported'].value_counts(dropna = False)

VARIOUS      2977
LIGHT        2803
DISK         2122
TRIANGLE     1889
OTHER        1402
CIRCLE       1365
SPHERE       1054
FIREBALL     1039
OVAL          845
CIGAR         617
FORMATION     434
RECTANGLE     303
CYLINDER      294
CHEVRON       248
DIAMOND       234
EGG           197
FLASH         188
TEARDROP      119
CONE           60
CROSS          36
DELTA           7
CRESCENT        2
ROUND           2
DOME            1
FLARE           1
HEXAGON         1
PYRAMID         1
Name: Shape Reported, dtype: int64

In [28]:
data['Shape Reported'].fillna(value = 'VARIOUS',inplace = True)